"""
    挿入ソート（insert_sort）
"""
def main():
    insert_sort()

def  insert_sort():
    
    data = [6, 15, 4, 2, 8, 5, 11, 9, 7, 13]

    # 挿入ソート
    for i in range(1, len(data)):

        # 挿入データ
        temp = data[i]
        j = i - 1

        """
          1回目：whileループが入らず、15を同じ箇所に挿入               → [6, 15, 4, 2, 8, 5, 11, 9, 7, 13]
          2回目：whileループを3回ループし、"4" を index "0"番目に挿入  → [4, 6, 15, 2, 8, 5, 11, 9, 7, 13]
          3回目：whileループを3回ループし、"2" を index "0"番目に挿入  → [2, 4, 6, 15, 8, 5, 11, 9, 7, 13]
          4回目：whileループを1回ループし、"8" を index "3"番目に挿入  → [2, 4, 6, 8, 15, 5, 11, 9, 7, 13]
          5回目：whileループを3回ループし、"5" を index "2"番目に挿入  → [2, 4, 5, 6, 8, 15, 11, 9, 7, 13]
          6回目：whileループを1回ループし、"11" を index "5"番目に挿入 → [2, 4, 5, 6, 8, 11, 15, 9, 7, 13]
          7回目：whileループを1回ループし、"9" を index "5"番目に挿入  → [2, 4, 5, 6, 8, 9, 11, 15, 7, 13]
          8回目：whileループを1回ループし、"9" を index "6"番目に挿入  → [2, 4, 5, 6, 7, 8, 9, 11, 15, 13]
          9回目：whileループを1回ループし、"13" を index "8"番目に挿入 → [2, 4, 5, 6, 7, 8, 9, 11, 13, 15]
          10回目：whileループを1回ループし、"13" を index "8"番目に挿入→ [2, 4, 5, 6, 7, 8, 9, 11, 13, 15]
        """
        while ( j >= 0 ) and ( data[j] > temp ):
            data[j + 1] = data[j]
            j -= 1
        data[j + 1] = temp
        print(data)
    print(data)

if __name__ == "__main__":
    main()